app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-02-02 14:14:08.352609"], ["id", 1]]
---
def update
  @article = Article.find(params[:id])
  @article.update(title: params[:title], description: params[:description])